espressif/esp-idf/components/soc/esp32c3/include/soc/spi_reg.h
#define SPI_DMA_INT_RAW_REG(i)          (REG_SPI_BASE(i) + 0x3C)
/* SPI_APP1_INT_RAW : R/W/WTC ;bitpos:[20] ;default: 1'b0 ; */
/*description: The raw bit for SPI_APP1_INT interrupt. The value is only controlled by applicat
ion..*/
#define SPI_APP1_INT_RAW    (BIT(20))
#define SPI_APP1_INT_RAW_M  (BIT(20))
#define SPI_APP1_INT_RAW_V  0x1
#define SPI_APP1_INT_RAW_S  20
/* SPI_APP2_INT_RAW : R/W/WTC ;bitpos:[19] ;default: 1'b0 ; */
/*description: The raw bit for SPI_APP2_INT interrupt. The value is only controlled by applicat
ion..*/
#define SPI_APP2_INT_RAW    (BIT(19))
#define SPI_APP2_INT_RAW_M  (BIT(19))
#define SPI_APP2_INT_RAW_V  0x1
#define SPI_APP2_INT_RAW_S  19
/* SPI_MST_TX_AFIFO_REMPTY_ERR_INT_RAW : R/W/WTC/SS ;bitpos:[18] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MST_TX_AFIFO_REMPTY_ERR_INT interrupt. 1: There is a TX BUF
AFIFO read-empty error when SPI outputs data in master mode. 0: Others..*/
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_RAW    (BIT(18))
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_RAW_M  (BIT(18))
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_RAW_V  0x1
#define SPI_MST_TX_AFIFO_REMPTY_ERR_INT_RAW_S  18
/* SPI_MST_RX_AFIFO_WFULL_ERR_INT_RAW : R/W/WTC/SS ;bitpos:[17] ;default: 1'b0 ; */
/*description: The raw bit for SPI_MST_RX_AFIFO_WFULL_ERR_INT interrupt. 1: There is a RX AFIFO
 write-full error when SPI inputs data in master mode. 0: Others..*/
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_RAW    (BIT(17))
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_RAW_M  (BIT(17))
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_RAW_V  0x1
#define SPI_MST_RX_AFIFO_WFULL_ERR_INT_RAW_S  17
/* SPI_SLV_CMD_ERR_INT_RAW : R/W/WTC/SS ;bitpos:[16] ;default: 1'b0 ; */
/*description: The raw bit for SPI_SLV_CMD_ERR_INT interrupt. 1: The slave command value in the
 current SPI slave HD mode transmission is not supported. 0: Others..*/
#define SPI_SLV_CMD_ERR_INT_RAW    (BIT(16))
#define SPI_SLV_CMD_ERR_INT_RAW_M  (BIT(16))
#define SPI_SLV_CMD_ERR_INT_RAW_V  0x1
#define SPI_SLV_CMD_ERR_INT_RAW_S  16
/* SPI_SLV_BUF_ADDR_ERR_INT_RAW : R/W/WTC/SS ;bitpos:[15] ;default: 1'b0 ; */
/*description: The raw bit for SPI_SLV_BUF_ADDR_ERR_INT interrupt. 1: The accessing data addres
s of the current SPI slave mode CPU controlled FD, Wr_BUF or Rd_BUF transmission
 is bigger than 63. 0: Others..*/
#define SPI_SLV_BUF_ADDR_ERR_INT_RAW    (BIT(15))
#define SPI_SLV_BUF_ADDR_ERR_INT_RAW_M  (BIT(15))
#define SPI_SLV_BUF_ADDR_ERR_INT_RAW_V  0x1
#define SPI_SLV_BUF_ADDR_ERR_INT_RAW_S  15
/* SPI_SEG_MAGIC_ERR_INT_RAW : R/W/WTC/SS ;bitpos:[14] ;default: 1'b0 ; */
/*description: The raw bit for SPI_SEG_MAGIC_ERR_INT interrupt. 1: The magic value in CONF buff
er is error in the DMA seg-conf-trans. 0: others..*/
#define SPI_SEG_MAGIC_ERR_INT_RAW    (BIT(14))
#define SPI_SEG_MAGIC_ERR_INT_RAW_M  (BIT(14))
#define SPI_SEG_MAGIC_ERR_INT_RAW_V  0x1
#define SPI_SEG_MAGIC_ERR_INT_RAW_S  14
/* SPI_DMA_SEG_TRANS_DONE_INT_RAW : R/W/WTC/SS ;bitpos:[13] ;default: 1'b0 ; */
/*description: The raw bit for SPI_DMA_SEG_TRANS_DONE_INT interrupt. 1:  spi master DMA full-du
plex/half-duplex seg-conf-trans ends or slave half-duplex seg-trans ends. And da
ta has been pushed to corresponding memory.  0:  seg-conf-trans or seg-trans is
not ended or not occurred. .*/
#define SPI_DMA_SEG_TRANS_DONE_INT_RAW    (BIT(13))
#define SPI_DMA_SEG_TRANS_DONE_INT_RAW_M  (BIT(13))
#define SPI_DMA_SEG_TRANS_DONE_INT_RAW_V  0x1
#define SPI_DMA_SEG_TRANS_DONE_INT_RAW_S  13
/* SPI_TRANS_DONE_INT_RAW : R/W/WTC/SS ;bitpos:[12] ;default: 1'b0 ; */
/*description: The raw bit for SPI_TRANS_DONE_INT interrupt. 1: SPI master mode transmission is
 ended. 0: others..*/
#define SPI_TRANS_DONE_INT_RAW    (BIT(12))
#define SPI_TRANS_DONE_INT_RAW_M  (BIT(12))
#define SPI_TRANS_DONE_INT_RAW_V  0x1
#define SPI_TRANS_DONE_INT_RAW_S  12
/* SPI_SLV_WR_BUF_DONE_INT_RAW : R/W/WTC/SS ;bitpos:[11] ;default: 1'b0 ; */
/*description: The raw bit for SPI_SLV_WR_BUF_DONE_INT interrupt. 1: SPI slave mode Wr_BUF tran
smission is ended. 0: Others..*/
#define SPI_SLV_WR_BUF_DONE_INT_RAW    (BIT(11))
#define SPI_SLV_WR_BUF_DONE_INT_RAW_M  (BIT(11))
#define SPI_SLV_WR_BUF_DONE_INT_RAW_V  0x1
#define SPI_SLV_WR_BUF_DONE_INT_RAW_S  11
/* SPI_SLV_RD_BUF_DONE_INT_RAW : R/W/WTC/SS ;bitpos:[10] ;default: 1'b0 ; */
/*description: The raw bit for SPI_SLV_RD_BUF_DONE_INT interrupt. 1: SPI slave mode Rd_BUF tran
smission is ended. 0: Others..*/
#define SPI_SLV_RD_BUF_DONE_INT_RAW    (BIT(10))
#define SPI_SLV_RD_BUF_DONE_INT_RAW_M  (BIT(10))
#define SPI_SLV_RD_BUF_DONE_INT_RAW_V  0x1
#define SPI_SLV_RD_BUF_DONE_INT_RAW_S  10
/* SPI_SLV_WR_DMA_DONE_INT_RAW : R/W/WTC/SS ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw bit for SPI_SLV_WR_DMA_DONE_INT interrupt. 1: SPI slave mode Wr_DMA tran
smission is ended. 0: Others..*/
#define SPI_SLV_WR_DMA_DONE_INT_RAW    (BIT(9))
#define SPI_SLV_WR_DMA_DONE_INT_RAW_M  (BIT(9))
#define SPI_SLV_WR_DMA_DONE_INT_RAW_V  0x1
#define SPI_SLV_WR_DMA_DONE_INT_RAW_S  9
/* SPI_SLV_RD_DMA_DONE_INT_RAW : R/W/WTC/SS ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw bit for SPI_SLV_RD_DMA_DONE_INT interrupt. 1: SPI slave mode Rd_DMA tran
smission is ended. 0: Others..*/
#define SPI_SLV_RD_DMA_DONE_INT_RAW    (BIT(8))
#define SPI_SLV_RD_DMA_DONE_INT_RAW_M  (BIT(8))
#define SPI_SLV_RD_DMA_DONE_INT_RAW_V  0x1
#define SPI_SLV_RD_DMA_DONE_INT_RAW_S  8
/* SPI_SLV_CMDA_INT_RAW : R/W/WTC/SS ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw bit for SPI slave CMDA interrupt. 1: SPI slave mode CMDA transmission is
 ended. 0: Others..*/
#define SPI_SLV_CMDA_INT_RAW    (BIT(7))
#define SPI_SLV_CMDA_INT_RAW_M  (BIT(7))
#define SPI_SLV_CMDA_INT_RAW_V  0x1
#define SPI_SLV_CMDA_INT_RAW_S  7
/* SPI_SLV_CMD9_INT_RAW : R/W/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw bit for SPI slave CMD9 interrupt. 1: SPI slave mode CMD9 transmission is
 ended. 0: Others..*/
#define SPI_SLV_CMD9_INT_RAW    (BIT(6))
#define SPI_SLV_CMD9_INT_RAW_M  (BIT(6))
#define SPI_SLV_CMD9_INT_RAW_V  0x1
#define SPI_SLV_CMD9_INT_RAW_S  6
/* SPI_SLV_CMD8_INT_RAW : R/W/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw bit for SPI slave CMD8 interrupt. 1: SPI slave mode CMD8 transmission is
 ended. 0: Others..*/
#define SPI_SLV_CMD8_INT_RAW    (BIT(5))
#define SPI_SLV_CMD8_INT_RAW_M  (BIT(5))
#define SPI_SLV_CMD8_INT_RAW_V  0x1
#define SPI_SLV_CMD8_INT_RAW_S  5
/* SPI_SLV_CMD7_INT_RAW : R/W/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw bit for SPI slave CMD7 interrupt. 1: SPI slave mode CMD7 transmission is
 ended. 0: Others..*/
#define SPI_SLV_CMD7_INT_RAW    (BIT(4))
#define SPI_SLV_CMD7_INT_RAW_M  (BIT(4))
#define SPI_SLV_CMD7_INT_RAW_V  0x1
#define SPI_SLV_CMD7_INT_RAW_S  4
/* SPI_SLV_EN_QPI_INT_RAW : R/W/WTC/SS ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw bit for SPI slave En_QPI interrupt. 1: SPI slave mode En_QPI transmissio
n is ended. 0: Others..*/
#define SPI_SLV_EN_QPI_INT_RAW    (BIT(3))
#define SPI_SLV_EN_QPI_INT_RAW_M  (BIT(3))
#define SPI_SLV_EN_QPI_INT_RAW_V  0x1
#define SPI_SLV_EN_QPI_INT_RAW_S  3
/* SPI_SLV_EX_QPI_INT_RAW : R/W/WTC/SS ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw bit for SPI slave Ex_QPI interrupt. 1: SPI slave mode Ex_QPI transmissio
n is ended. 0: Others..*/
#define SPI_SLV_EX_QPI_INT_RAW    (BIT(2))
#define SPI_SLV_EX_QPI_INT_RAW_M  (BIT(2))
#define SPI_SLV_EX_QPI_INT_RAW_V  0x1
#define SPI_SLV_EX_QPI_INT_RAW_S  2
/* SPI_DMA_OUTFIFO_EMPTY_ERR_INT_RAW : R/W/WTC/SS ;bitpos:[1] ;default: 1'b0 ; */
/*description: 1: The current data rate of DMA TX is smaller than that of SPI. SPI will stop in
 master mode and send out all 0 in slave mode.  0: Others.  .*/
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_RAW    (BIT(1))
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_RAW_M  (BIT(1))
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_RAW_V  0x1
#define SPI_DMA_OUTFIFO_EMPTY_ERR_INT_RAW_S  1
/* SPI_DMA_INFIFO_FULL_ERR_INT_RAW : R/W/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1: The current data rate of DMA Rx is smaller than that of SPI, which will lose
the receive data.  0: Others.  .*/
#define SPI_DMA_INFIFO_FULL_ERR_INT_RAW    (BIT(0))
#define SPI_DMA_INFIFO_FULL_ERR_INT_RAW_M  (BIT(0))
#define SPI_DMA_INFIFO_FULL_ERR_INT_RAW_V  0x1
#define SPI_DMA_INFIFO_FULL_ERR_INT_RAW_S  0

